In [43]:
# 주피터 노트북 테마 설정
# !pip install jupyterthemes
# !jt -t onedork -fs 115 -nfs 125 -tfs 115 -dfs 115 -ofs 115 -cursc r -cellw 80% -lineh 115 -altmd  -kl -T -N

In [44]:
# 주피터 노트북 익스텐션 설정
# ! jupyter contrib nbextension install --user

In [45]:
import pandas as pd

# 실행 프로세스

In [46]:
c_df = pd.read_csv('bank3_customers.csv') # index_col은 인덱스로 활용된 칼럼이 삭제됨
c_df.set_index('c_id', drop = False, inplace=True) # drop=false는 인덱스로 활용된 칼럼 유지
print('고객 데이터 임포트 성공')
c_df

고객 데이터 임포트 성공

     c_id  name  account_num  total_amount     rat
c_id
1c     1c   최원칠            2           500  silver
2c     2c   이서혁            1          2000    gold
3c     3c  aiot            3         50000     vip
4c     4c    새싹            4        200000    vvip

In [47]:
a_df = pd.read_csv('bank3_accounts.csv')
a_df.set_index('a_id', drop = False, inplace=True)
print('계좌 데이터 임포트 성공')
a_df

계좌 데이터 임포트 성공

     a_id password c_id  amount
a_id
11a   11a      11p   1c     100
12a   12a      12p   1c     400
21a   21a      21p   2c    2000
31a   31a      31p   3c   10000
32a   32a      32p   3c   20000
33a   33a      33p   3c   20000
41a   41a      41p   4c  100000
42a   42a      42p   4c   50000
43a   43a      43p   4c   20000
44a   44a      44p   4c   30000

# 클래스 프로세스

## add_account 함수 수정

In [48]:
# 더미 인풋 데이터
# self.customer , 시리즈
print(type(c_df.iloc[0]))
c_self = c_df.iloc[0] 
print(c_self)

print('='*50)
# self.accounts, 데이터 프레임
a_id = 'aa'
a_self = a_df.copy()
print(a_self)

<class 'pandas.core.series.Series'>
c_id                1c
name               최원칠
account_num          2
total_amount       500
rat             silver
Name: 1c, dtype: object
==================================================
     a_id password c_id  amount
a_id
11a   11a      11p   1c     100
12a   12a      12p   1c     400
21a   21a      21p   2c    2000
31a   31a      31p   3c   10000
32a   32a      32p   3c   20000
33a   33a      33p   3c   20000
41a   41a      41p   4c  100000
42a   42a      42p   4c   50000
43a   43a      43p   4c   20000
44a   44a      44p   4c   30000

In [49]:
# self.accounts 에 a_df 형태에 맞게 새로운 계좌 데이터를 할당
a_self.loc[a_id] = {'a_id': a_id,
                  'amount': 0,
                 'c_id': c_self['c_id']}
a_self

     a_id password c_id  amount
a_id
11a   11a      11p   1c     100
12a   12a      12p   1c     400
21a   21a      21p   2c    2000
31a   31a      31p   3c   10000
32a   32a      32p   3c   20000
33a   33a      33p   3c   20000
41a   41a      41p   4c  100000
42a   42a      42p   4c   50000
43a   43a      43p   4c   20000
44a   44a      44p   4c   30000
aa     aa      NaN   1c       0

In [50]:
# add_account 함수 수정
# self.customer 의 계좌개수를 +1
c_self['account_num'] += 1
c_self

C:\Users\YUNA\AppData\Local\Temp\ipykernel_7228\2393851844.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  c_self['account_num'] += 1

c_id                1c
name               최원칠
account_num          3
total_amount       500
rat             silver
Name: 1c, dtype: object

## add_amount 함수 수정

In [153]:
# 더미 입금 금액
amount_input = 9999
amount_input

9999

In [156]:
a_id

'aa'

In [155]:
a_self.loc[a_id, 'amount']

8888

In [52]:
# self.accounts 에서 해당 계좌번호의 계좌금액에서 입금금액 추가
a_self.loc[a_id, 'amount'] += amount_input
a_self

     a_id password c_id  amount
a_id
11a   11a      11p   1c     100
12a   12a      12p   1c     400
21a   21a      21p   2c    2000
31a   31a      31p   3c   10000
32a   32a      32p   3c   20000
33a   33a      33p   3c   20000
41a   41a      41p   4c  100000
42a   42a      42p   4c   50000
43a   43a      43p   4c   20000
44a   44a      44p   4c   30000
aa     aa      NaN   1c    9999

In [53]:
# 더미 총합금액 및 등급
get_total_amount = 999999999
get_rat = 'vvvvip'

In [54]:
# self.customer 의 총합금액과 등급 업데이트
print(c_self)
print('=' * 50)
c_self['total_amount'] =  get_total_amount
c_self['rat'] = get_rat
print(c_self)

c_id                1c
name               최원칠
account_num          3
total_amount       500
rat             silver
Name: 1c, dtype: object
==================================================
c_id                   1c
name                  최원칠
account_num             3
total_amount    999999999
rat                vvvvip
Name: 1c, dtype: object

C:\Users\YUNA\AppData\Local\Temp\ipykernel_7228\1069454643.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  c_self['total_amount'] =  get_total_amount
C:\Users\YUNA\AppData\Local\Temp\ipykernel_7228\1069454643.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  c_self['rat'] = get_rat

## sub_amount 함수 수정

In [55]:
# 더미 출금 금액
amount_withdraw = 1111
amount_withdraw

1111

In [56]:
# self.accounts 에서 해당 계좌번호의 계좌금액에서 출금금액 차감
a_self.loc[a_id, 'amount'] -= amount_withdraw
a_self

     a_id password c_id  amount
a_id
11a   11a      11p   1c     100
12a   12a      12p   1c     400
21a   21a      21p   2c    2000
31a   31a      31p   3c   10000
32a   32a      32p   3c   20000
33a   33a      33p   3c   20000
41a   41a      41p   4c  100000
42a   42a      42p   4c   50000
43a   43a      43p   4c   20000
44a   44a      44p   4c   30000
aa     aa      NaN   1c    8888

In [57]:
# 더미 총합금액 및 등급
get_total_amount = 555555
get_rat = 'svip'

In [58]:
# self.customer 의 총합금액과 등급 업데이트
print(c_self)
print('=' * 50)
c_self['total_amount'] =  get_total_amount
c_self['rat'] = get_rat
print(c_self)

c_id                   1c
name                  최원칠
account_num             3
total_amount    999999999
rat                vvvvip
Name: 1c, dtype: object
==================================================
c_id                1c
name               최원칠
account_num          3
total_amount    555555
rat               svip
Name: 1c, dtype: object

C:\Users\YUNA\AppData\Local\Temp\ipykernel_7228\1069454643.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  c_self['total_amount'] =  get_total_amount
C:\Users\YUNA\AppData\Local\Temp\ipykernel_7228\1069454643.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  c_self['rat'] = get_rat

## get_total_amount 함수 생성

In [59]:
# 더미 고객 아이디
c_id = '1c'

In [60]:
# 고객이 가지고 있는 모든 계좌의 총합을 반환
a_self[a_self['c_id'] == c_self['c_id']]['amount'].sum()

9388

## update 함수 생성

In [61]:
print(c_self)
print('='*50)
c_df

c_id                1c
name               최원칠
account_num          3
total_amount    555555
rat               svip
Name: 1c, dtype: object
==================================================

     c_id  name  account_num  total_amount     rat
c_id
1c     1c   최원칠            2           500  silver
2c     2c   이서혁            1          2000    gold
3c     3c  aiot            3         50000     vip
4c     4c    새싹            4        200000    vvip

In [62]:
# 클래스내의 수정된 고객시리즈 데이터를 고객데이터프레임에 업데이트
c_df.update([c_self])
c_df

C:\Users\YUNA\AppData\Local\Temp\ipykernel_7228\2380203065.py:2: FutureWarning: In a future version, `df.iloc[:, i] = newvals` will attempt to set the values inplace instead of always setting a new array. To retain the old behavior, use either `df[df.columns[i]] = newvals` or, if columns are non-unique, `df.isetitem(i, newvals)`
  c_df.update([c_self])

     c_id  name  account_num  total_amount   rat
c_id
1c     1c   최원칠          3.0      555555.0  svip
2c     2c   이서혁          1.0        2000.0  gold
3c     3c  aiot          3.0       50000.0   vip
4c     4c    새싹          4.0      200000.0  vvip

In [63]:
print(a_self)
print('='*50)
a_df

     a_id password c_id  amount
a_id
11a   11a      11p   1c     100
12a   12a      12p   1c     400
21a   21a      21p   2c    2000
31a   31a      31p   3c   10000
32a   32a      32p   3c   20000
33a   33a      33p   3c   20000
41a   41a      41p   4c  100000
42a   42a      42p   4c   50000
43a   43a      43p   4c   20000
44a   44a      44p   4c   30000
aa     aa      NaN   1c    8888
==================================================

     a_id password c_id  amount
a_id
11a   11a      11p   1c     100
12a   12a      12p   1c     400
21a   21a      21p   2c    2000
31a   31a      31p   3c   10000
32a   32a      32p   3c   20000
33a   33a      33p   3c   20000
41a   41a      41p   4c  100000
42a   42a      42p   4c   50000
43a   43a      43p   4c   20000
44a   44a      44p   4c   30000

In [89]:
# 클래스내의 수정된  데이터를 고객데이터프레임에 업데이트
# a_df.loc[a_id] = a_self.loc[a_id] # a_id 값을 모르므로 불가
# a_df = a_self # 덮어씌우기
for a_id in a_self.index: #  인덱스 하나씩 삽입
    a_df.loc[a_id] = a_self.loc[a_id]
a_df

     a_id password c_id    amount
a_id
11a   11a      11p   1c     100.0
12a   12a      12p   1c     400.0
21a   21a      21p   2c    2000.0
31a   31a      31p   3c   10000.0
32a   32a      32p   3c   20000.0
33a   33a      33p   3c   20000.0
41a   41a      41p   4c  100000.0
42a   42a      42p   4c   50000.0
43a   43a      43p   4c   20000.0
44a   44a      44p   4c   30000.0
aa     aa      NaN   1c    8888.0

# 뱅킹 모듈 프로세스

## create_customer함수 수정

In [90]:
c_name = 'ㅂㅈㄷ'
c_id = '99c'

In [91]:
# 고객 데이터프레임에 입력받은 고객아이디를 인덱스로 고객데이터 추가
# 고객데이터는 고객데이터프레임의 컬럼에 맞게 구성(딕셔너리추천) 
customer = {'c_id': c_id,
         'name': c_name,
         'account_num': 0,
         'total_amount': 0,
         'rat': 'normal'}
c_df.loc[c_id] = customer

## show_list 함수 수정

In [92]:
# 모든 고객의 고객 이름과 고객 아이디를 다음과 같이 출력
# '고객이름:{} 고객번호:{}' {}안은 실제 데이터가 입력
for c in c_df.iloc:
    print(f'고객이름 : {c["name"]}, 고객번호 : {c["c_id"]}')

고객이름 : 최원칠, 고객번호 : 1c
고객이름 : 이서혁, 고객번호 : 2c
고객이름 : aiot, 고객번호 : 3c
고객이름 : 새싹, 고객번호 : 4c
고객이름 : ㅂㅈㄷ, 고객번호 : 99c

## search_customer 함수 수정

In [95]:
# 파라미터
c_id = '1c'

In [96]:
a_df[a_df['c_id']==c_id]

     a_id password c_id  amount
a_id
11a   11a      11p   1c   100.0
12a   12a      12p   1c   400.0
aa     aa      NaN   1c  8888.0

In [97]:
# 고객이 있다면 고객데이터프레임에서 해당 고객아이디에 해당하는 시리즈 customer 변수에 할당
def search_customer(c_id) :
    if c_id in c_df.index :
        customer = c_df.loc[c_id]
        # 고객이 있다면 계좌데이터프레임 에서 해당 고객아이디에 해당하는 데이터프레임 account 변수에 할당
        account = a_df[a_df['c_id']==c_id]
        # 데이터프레임은 기본적으로 복사본을 반환(리턴)
        # 해당 데이터로 고객 인스턴스 생성하여 반환
    #     c = Customer(customer, account)
    #     return c
        return customer, account
    # 고객이 없다면 None 반환   
    return None

In [101]:
search_customer(c_id)

(c_id                  1c
 name                 최원칠
 account_num          3.0
 total_amount    555555.0
 rat                 svip
 Name: 1c, dtype: object,
      a_id password c_id  amount
 a_id
 11a   11a      11p   1c   100.0
 12a   12a      12p   1c   400.0
 aa     aa      NaN   1c  8888.0)

## create_acount 함수 수정

In [105]:
# search_customer 를 통해 고객을 찾고 새 계좌 생성
c_id = input('고객 번호 입력: \n')
c, a = search_customer(c_id)
# if c is None:
#     return c

account_num = input('계좌번호 입력: \n')
# 계좌, 고객 데이터프레임 업데이트(고객 클래스에 update활용)
# c.update(c_df, a_df)

# '{} 고객의 {} 계좌가 등록되었습니다' 출력
# print('{} 고객의 {} 계좌가 등록되었습니다'
#       .format(c.get_name(),
#               account_num,
#               ))

고객 번호 입력:
1c
계좌번호 입력:
123

AttributeError: 'Series' object has no attribute 'get_name'

## deposit 함수 생성

In [149]:
a.loc['11a','amount']

100.0

In [151]:
# search_customer 를 통해 고객을 찾음
# 입력받은 계좌에 입력받은 금액 추가
# 데이터프레임 업데이트(고객 클래스에 update활용)
c_id = input('고객 번호 입력: \n')
c, a = search_customer(c_id)
c
account_num = input('계좌번호 입력: \n')
amount = input('입금할 금액 입력: \n')
print(c)
a.loc[account_num,'amount'] += int(amount)

고객 번호 입력:
1c
계좌번호 입력:
11a
입금할 금액 입력:
9999
c_id                  1c
name                 최원칠
account_num          3.0
total_amount    555555.0
rat                 svip
Name: 1c, dtype: object

In [152]:
a

     a_id password c_id   amount
a_id
11a   11a      11p   1c  10099.0
12a   12a      12p   1c    400.0
aa     aa      NaN   1c   8888.0

## withdraw 함수 수정

In [ ]:
# 위와 상동

## ca_merge 함수 생성

In [123]:
# 고객데이터프레임에 계좌데이터프레임을 결합(merge)하여 ca_merge.csv’ 파일로 저장
# 결합시 고객아이디(’c_id’) 를 기준으로 결합
merge_df = c_df.join(a_df.set_index('c_id'))
merge_df.to_csv('ca_merge.csv', index=False)

## group_rat_count 함수 생성

In [136]:
# 고객등급별 고객 명수 출력
# groupby함수 사용할것
# 다음과 같은 데이터프레임으로 출력
#    - 인덱스: 고객등급
#    - 컬럼: 고객명수(’count’)
result = merge_df[['c_id', 'rat']].groupby('rat').count()
result.rename(columns={'c_id':'count'}, inplace=True)
result

        count
rat
gold        1
normal      1
svip        3
vip         3
vvip        4